### Basic dataframe operations

In [1]:
import pandas as pd
df = pd.read_csv(r'C:\Users\Lenovo\OneDrive\Documents\Datasets\titanic.csv')
df.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [2]:
type(df)

pandas.core.frame.DataFrame

In [3]:
df.shape

(891, 15)

In [4]:
df.index

RangeIndex(start=0, stop=891, step=1)

In [5]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [6]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

### Accessing data

In [8]:
series = df['age']
series

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [9]:
type(series)

pandas.core.series.Series

In [10]:
series.ndim

1

In [11]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [12]:
subset = df[['who', 'age', 'survived']]
subset

       who   age  survived
0      man  22.0         0
1    woman  38.0         1
2    woman  26.0         1
3    woman  35.0         1
4      man  35.0         0
..     ...   ...       ...
886    man  27.0         0
887  woman  19.0         1
888  woman   NaN         0
889    man  26.0         1
890    man  32.0         0

[891 rows x 3 columns]

In [13]:
subset.ndim

2

In [14]:
df[:1]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.25,S,Third,man,True,NaN,Southampton,no,False

In [15]:
df.iloc[5:15,[1,3,5,7,9]]

    pclass   age  parch embarked    who
5        3   NaN      0        Q    man
6        1  54.0      0        S    man
7        3   2.0      1        S  child
8        3  27.0      2        S  woman
9        2  14.0      0        C  child
10       3   4.0      1        S  child
11       1  58.0      0        S  woman
12       3  20.0      0        S    man
13       3  39.0      5        S    man
14       3  14.0      0        S  child

In [16]:
age_series = df['age']
age_series.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [17]:
print(age_series.dtype)  
print(age_series.index)  
print(age_series.shape)

float64
RangeIndex(start=0, stop=891, step=1)
(891,)

In [18]:
print(age_series.describe())

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64

In [19]:
print(age_series.iloc[0])
print(age_series.loc[0:10])

22.0
0     22.0
1     38.0
2     26.0
3     35.0
4     35.0
5      NaN
6     54.0
7      2.0
8     27.0
9     14.0
10     4.0
Name: age, dtype: float64

In [20]:
age_col = df['age']
age_col>30

0      False
1       True
2      False
3       True
4       True
       ...
886    False
887    False
888    False
889    False
890     True
Name: age, Length: 891, dtype: bool

In [21]:
age_col[age_col>30]

1      38.0
3      35.0
4      35.0
6      54.0
11     58.0
       ...
873    47.0
879    56.0
881    33.0
885    39.0
890    32.0
Name: age, Length: 305, dtype: float64

In [22]:
# Filter to find ages greater than 18
age_series = df['age']
adult_ages = age_series[age_series>18]
print(adult_ages.head())

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [23]:
# Filter to find ages greater than 18
ageName_series = df[['age', 'who']]

# Now I'll filter based on condition
adult_ages = ageName_series[ageName_series['age']>18]
print(adult_ages.head())

    age    who
0  22.0    man
1  38.0  woman
2  26.0  woman
3  35.0  woman
4  35.0    man

In [24]:
# Filter and show all passengers who survived.
df[df['survived']==1]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
875,1,3,female,15.0,0,0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [25]:
# Display all female passengers who were in third class.
female_3rdclass = df[(df['sex']=='female') & (df['class']=='Third')]
female_3rdclass

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,no,True
18,0,3,female,31.0,1,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
875,1,3,female,15.0,0,0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [26]:
# Identify passengers who embarked from Southampton (S) and paid a fare greater than $50.
df[(df['embark_town']=='Southampton') & (df['fare']>50)]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
27,0,1,male,19.0,3,2,263.0000,S,First,man,True,C,Southampton,no,False
35,0,1,male,42.0,1,0,52.0000,S,First,man,True,NaN,Southampton,no,False
62,0,1,male,45.0,1,0,83.4750,S,First,man,True,C,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
846,0,3,male,NaN,8,2,69.5500,S,Third,man,True,NaN,Southampton,no,False
856,1,1,female,45.0,1,1,164.8667,S,First,woman,False,NaN,Southampton,yes,False
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
867,0,1,male,31.0,0,0,50.4958,S,First,man,True,A,Southampton,no,True
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False

In [27]:
# List all passengers who were minors (under 18 years old) traveling alone (without siblings or parents).
minor = df[( df['age']<18) & ((df['sibsp']==0) | (df['parch']==0))]
print(minor.head())
print(minor.shape)

    survived  pclass     sex    age  sibsp  parch     fare embarked   class  \
9          1       2  female  14.00      1      0  30.0708        C  Second
14         0       3  female  14.00      0      0   7.8542        S   Third
22         1       3  female  15.00      0      0   8.0292        Q   Third
39         1       3  female  14.00      1      0  11.2417        C   Third
78         1       2    male   0.83      0      2  29.0000        S  Second

      who  adult_male deck  embark_town alive  alone
9   child       False  NaN    Cherbourg   yes  False
14  child       False  NaN  Southampton    no   True
22  child       False  NaN   Queenstown   yes   True
39  child       False  NaN    Cherbourg   yes  False
78  child       False  NaN  Southampton   yes  False
(52, 15)

In [28]:
# Find all passengers who were aged 65 or older.
df[df['age']>=65]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
33,0,2,male,66.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
54,0,1,male,65.0,0,1,61.9792,C,First,man,True,B,Cherbourg,no,False
96,0,1,male,71.0,0,0,34.6542,C,First,man,True,A,Cherbourg,no,True
116,0,3,male,70.5,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
280,0,3,male,65.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
456,0,1,male,65.0,0,0,26.5500,S,First,man,True,E,Southampton,no,True
493,0,1,male,71.0,0,0,49.5042,C,First,man,True,NaN,Cherbourg,no,True
630,1,1,male,80.0,0,0,30.0000,S,First,man,True,A,Southampton,yes,True
672,0,2,male,70.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
745,0,1,male,70.0,1,1,71.0000,S,First,man,True,B,Southampton,no,False
851,0,3,male,74.0,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True

In [29]:
# Show details of passengers who had a cabin and were in second class.
df['deck'].unique()

array([nan, 'C', 'E', 'G', 'D', 'A', 'B', 'F'], dtype=object)

In [30]:
df[(df['deck'].notna()) & (df['class']=="Second")]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
21,1,2,male,34.0,0,0,13.0000,S,Second,man,True,D,Southampton,yes,True
66,1,2,female,29.0,0,0,10.5000,S,Second,woman,False,F,Southampton,yes,True
123,1,2,female,32.5,0,0,13.0000,S,Second,woman,False,E,Southampton,yes,True
148,0,2,male,36.5,0,2,26.0000,S,Second,man,True,F,Southampton,no,False
183,1,2,male,1.0,2,1,39.0000,S,Second,child,False,F,Southampton,yes,False
193,1,2,male,3.0,1,1,26.0000,S,Second,child,False,F,Southampton,yes,False
292,0,2,male,36.0,0,0,12.8750,C,Second,man,True,D,Cherbourg,no,True
303,1,2,female,NaN,0,0,12.3500,Q,Second,woman,False,E,Queenstown,yes,True
327,1,2,female,36.0,0,0,13.0000,S,Second,woman,False,D,Southampton,yes,True
340,1,2,male,2.0,1,1,26.0000,S,Second,child,False,F,Southampton,yes,False
345,1,2,female,24.0,0,0,13.0000,S,Second,woman,False,F,Southampton,yes,True
473,1,2,female,23.0,0,0,13.7917,C,Second,woman,False,D,Cherbourg,yes,True
516,1,2,female,34.0,0,0,10.5000,S,Second,woman,False,F,Southampton,yes,True
618,1,2,female,4.0,2,1,39.0000,S,Second,child,False,F,Southampton,yes,False
717,1,2,female,27.0,0,0,10.5000,S,Second,woman,False,E,Southampton,yes,True
772,0,2,female,57.0,0,0,10.5000,S,Second,woman,False,E,Southampton,no,True

In [31]:
# Find all female passengers who did not survive.
df[(df['sex']=='female') & (df['survived']==0)]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,no,True
18,0,3,female,31.0,1,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False
24,0,3,female,8.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
38,0,3,female,18.0,2,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False
40,0,3,female,40.0,1,0,9.4750,S,Third,woman,False,NaN,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
854,0,2,female,44.0,1,0,26.0000,S,Second,woman,False,NaN,Southampton,no,False
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [32]:
# List all passengers who were in first class and embarked from Cherbourg (C).
df[(df['class']=="First") & (df['embark_town']=='Cherbourg')]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
30,0,1,male,40.0,0,0,27.7208,C,First,man,True,NaN,Cherbourg,no,True
31,1,1,female,NaN,1,0,146.5208,C,First,woman,False,B,Cherbourg,yes,False
34,0,1,male,28.0,1,0,82.1708,C,First,man,True,NaN,Cherbourg,no,False
52,1,1,female,49.0,1,0,76.7292,C,First,woman,False,D,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
839,1,1,male,NaN,0,0,29.7000,C,First,man,True,C,Cherbourg,yes,True
842,1,1,female,30.0,0,0,31.0000,C,First,woman,False,NaN,Cherbourg,yes,True
849,1,1,female,NaN,1,0,89.1042,C,First,woman,False,C,Cherbourg,yes,False
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [33]:
# Find all passengers who paid more than the 75th percentile of fares and survived.
df['fare'].describe()

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: fare, dtype: float64

In [34]:
print(f'75 percentile of all fares is {df['fare'].quantile(0.75)}')
df[(df['fare']>df['fare'].quantile(0.75)) & (df['survived']==1)]

75 percentile of all fares is 31.0

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
23,1,1,male,28.0,0,0,35.5000,S,First,man,True,A,Southampton,yes,True
25,1,3,female,38.0,1,5,31.3875,S,Third,woman,False,NaN,Southampton,yes,False
31,1,1,female,NaN,1,0,146.5208,C,First,woman,False,B,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
849,1,1,female,NaN,1,0,89.1042,C,First,woman,False,C,Cherbourg,yes,False
853,1,1,female,16.0,0,1,39.4000,S,First,woman,False,D,Southampton,yes,False
856,1,1,female,45.0,1,1,164.8667,S,First,woman,False,NaN,Southampton,yes,False
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False

In [35]:
# Q10: Display details of passengers who were under 30 years old
df[df['age']<30]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [36]:
# Q11. Identify passengers who embarked from Queenstown (Q) or Cherbourg (C) and whose ticket class was either first or second class, but did not survive.
df[((df['embark_town']=='Queenstown') | (df['embark_town']=='Cherbourg')) & ((df['class']=='First') | (df['class']=='Second'))]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
30,0,1,male,40.0,0,0,27.7208,C,First,man,True,NaN,Cherbourg,no,True
31,1,1,female,NaN,1,0,146.5208,C,First,woman,False,B,Cherbourg,yes,False
34,0,1,male,28.0,1,0,82.1708,C,First,man,True,NaN,Cherbourg,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
849,1,1,female,NaN,1,0,89.1042,C,First,woman,False,C,Cherbourg,yes,False
866,1,2,female,27.0,1,0,13.8583,C,Second,woman,False,NaN,Cherbourg,yes,False
874,1,2,female,28.0,1,0,24.0000,C,Second,woman,False,NaN,Cherbourg,yes,False
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [37]:
# Q12: List all passengers who had a cabin on deck 'B' and were traveling alone (no siblings/spouses/parents/children).

df[(df['deck']=='B') & ((df['sibsp']==0) | (df['parch']==0))].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
31,1,1,female,NaN,1,0,146.5208,C,First,woman,False,B,Cherbourg,yes,False
54,0,1,male,65.0,0,1,61.9792,C,First,man,True,B,Cherbourg,no,False
61,1,1,female,38.0,0,0,80.0000,NaN,First,woman,False,B,NaN,yes,True
118,0,1,male,24.0,0,1,247.5208,C,First,man,True,B,Cherbourg,no,False
139,0,1,male,24.0,0,0,79.2000,C,First,man,True,B,Cherbourg,no,True

In [38]:
# Q13. Find passengers who were older than the median age of the dataset, traveled in third class,
# and paid a fare less than the median fare of third-class passengers.

med_age = df['age'].median()
med_fare_3C = df.groupby(['class'])['fare'].median()['Third']
print(f'median age {med_age} \nmedian fare {med_fare_3C}')

df[(df['age']>med_age) & (df['class']=='Third') & (df['fare']<med_fare_3C)].head()

median age 28.0
median fare 8.05

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
57,0,3,male,28.5,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
94,0,3,male,59.0,0,0,7.2500,S,Third,man,True,NaN,Southampton,no,True
104,0,3,male,37.0,2,0,7.9250,S,Third,man,True,NaN,Southampton,no,False
108,0,3,male,38.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
116,0,3,male,70.5,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [39]:
# Q14: Show passengers who survived and are either staff (not having a passenger class-it means pclass is na) or children under 15 who were in any class.
# Assuming 'Staff' can be deduced by NaNs in 'Pclass' or some other criteria

print(f'Distinct items in pclass {df['pclass'].unique()}')
df[(df['survived']==1) & ( (df['pclass'].isna()) | ((df['who']=='child') & (df['age']<15) ))].head()

Distinct items in pclass [3 1 2]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
39,1,3,female,14.0,1,0,11.2417,C,Third,child,False,NaN,Cherbourg,yes,False
43,1,2,female,3.0,1,2,41.5792,C,Second,child,False,NaN,Cherbourg,yes,False
58,1,2,female,5.0,1,2,27.7500,S,Second,child,False,NaN,Southampton,yes,False

In [40]:
# Q15: Display all female passengers from first class whose fare was above the average fare of first-class passengers and who embarked at Cherbourg (C).
avg_fare = df.groupby('class')['fare'].mean()['First']
print(f'Avg fare of 1st class is {avg_fare}')
df[(df['sex']=='female') & (df['class']=='first') & (df['fare']>avg_fare) & (df['embark_town']=='Cherbourg')]

Avg fare of 1st class is 84.1546875

Empty DataFrame
Columns: [survived, pclass, sex, age, sibsp, parch, fare, embarked, class, who, adult_male, deck, embark_town, alive, alone]
Index: []

In [41]:
# Q16. Group passengers by class and find the average age and median fare for each class.

df.groupby('class').agg({'age':'mean','fare':'median'})

              age     fare
class
First   38.233441  60.2875
Second  29.877630  14.2500
Third   25.140620   8.0500

In [42]:
# Q17 Sort the passengers by fare in descending order and display the top 10 most expensive tickets.

df.sort_values(by='fare',ascending=False).head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
679,1,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,yes,False
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True
737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,yes,True
88,1,1,female,23.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
438,0,1,male,64.0,1,4,263.0000,S,First,man,True,C,Southampton,no,False
341,1,1,female,24.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
27,0,1,male,19.0,3,2,263.0000,S,First,man,True,C,Southampton,no,False
742,1,1,female,21.0,2,2,262.3750,C,First,woman,False,B,Cherbourg,yes,False
311,1,1,female,18.0,2,2,262.3750,C,First,woman,False,B,Cherbourg,yes,False
299,1,1,female,50.0,0,1,247.5208,C,First,woman,False,B,Cherbourg,yes,False

In [43]:
# Q18 Create a pivot table showing the average fare and survival rate grouped by passenger class and sex.

pivot_table = df.pivot_table(values=['fare', 'survived'],
                                  index=['pclass', 'sex'],
                                  aggfunc={'fare': 'mean', 'survived': 'mean'})
pivot_table

                     fare  survived
pclass sex
1      female  106.125798  0.968085
       male     67.226127  0.368852
2      female   21.970121  0.921053
       male     19.741782  0.157407
3      female   16.118810  0.500000
       male     12.661633  0.135447

In [44]:
df.pivot_table(values = ["fare", "age"],
               index = ["pclass", "sex"],
               aggfunc = {"fare" : 'mean', "age": "mean"})

                     age        fare
pclass sex
1      female  34.611765  106.125798
       male    41.281386   67.226127
2      female  28.722973   21.970121
       male    30.740707   19.741782
3      female  21.750000   16.118810
       male    26.507589   12.661633

In [45]:
df.pivot_table(values = ["age"],
               index = ["pclass", "sex"],
               aggfunc = {"age": "mean"},
               fill_value = 29.6)

                     age
pclass sex
1      female  34.611765
       male    41.281386
2      female  28.722973
       male    30.740707
3      female  21.750000
       male    26.507589

In [46]:
df['embarked'].value_counts()

embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [47]:
# Q19: List the total number of survivors and non-survivors for each embarkation point.

survival_counts = df.groupby('embarked')['survived'].value_counts().unstack()
survival_counts

survived    0    1
embarked
C          75   93
Q          47   30
S         427  217

In [48]:
# Q20: Find the top three ages with the highest average fare, grouped by passenger class.

df.groupby(['pclass','age'])['fare'].mean().sort_values(ascending=False).groupby('pclass').head(3)

pclass  age
1       15.0    211.337500
        43.0    211.337500
        18.0    169.612500
2       21.0     42.250000
        60.0     39.000000
        48.0     39.000000
3       7.0      34.406250
        11.0     32.320833
        9.0      27.938537
Name: fare, dtype: float64

In [50]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [60]:
# Q21. Display the maximum and minimum ages of passengers for each combination of survival status and class.**
df.groupby(['survived','class'])['age'].agg(['max', 'min'])

                  max    min
survived class
0        First   71.0   2.00
         Second  70.0  16.00
         Third   74.0   1.00
1        First   80.0   0.92
         Second  62.0   0.67
         Third   63.0   0.42

In [ ]:
# Q22: Calculate and display the total fare and number of passengers for each major cabin deck (A, B, C, etc.), assuming the first letter of the cabin number indicates the deck.**
df['deck'] = df['deck'].str[0]                                          # Extract the deck from Cabin
df.groupby('deck').agg({'fare':'sum','deck':'size'})

           fare  deck
deck
A      594.3583    15
B     5334.7709    47
C     5908.9291    59
D     1889.0710    33
E     1472.8542    32
F      243.0583    13
G       54.3250     4